app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
  def index
    @blogs = Blog.all

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def show
    @blog = Blog.find(params[:id])

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @blog = Blog.find(params[:id])

INSERT INTO `blogs` (`blog_title`, `blog_url`, `blogger_name`, `blogger_type`, `created_at`, `git_url`, `updated_at`) VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT 1 FROM `blogs` WHERE (`blogs`.`blog_url` = BINARY 'http://abhishekbahuguna.blogspot.in/' AND `blogs`.`id` != 2) LIMIT 1
---
  def create
    @blog = Blog.new(params[:blog])
    @blog.git_url = "https://github.com/" << params[:blog][:git_url]
    respond_to do |format|
      if @blog.save
        urls1 = [ "http://patshaughnessy.net/","http://patshaughnessy.net"]
        urls2= ["http://www.alexrothenberg.com/", "http://www.alexrothenberg.com"]
       if urls1.include?(@blog.blog_url)

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def update
    @blog = Blog.find(params[:id])