app/controllers/read_blogs_controller.rb

  def index
    @blogs = Blog.all
    @posts = Post.order("post_date DESC").page(params[:page])
---
SELECT `blogs`.* FROM `blogs`
SELECT COUNT(*) FROM `posts`
SELECT `posts`.* FROM `posts` ORDER BY post_date DESC LIMIT 5 OFFSET 0

  def home
    @blogs = Blog.all
---
SELECT `blogs`.* FROM `blogs`